Documents/Тренировка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>Тренировка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Тренировка</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Спортсмен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спортсмен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЖурналТренировок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Упражнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Упражнение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Стиль</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Повторы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>19</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КонтрольВосстановления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>КонтрольВосстановления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГруппаМышц</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппаМышц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Стиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стиль</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упражнение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Упражнение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Тренировка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>Тренировка</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сделано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Спортсмен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спортсмен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упражнение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Упражнение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Стиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стиль</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдИзм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницаИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Тренировка/Ext/ManagerModule.bsl
#Область ОписаниеПеременных
#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ПолучитьКрайнееФИО() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Тренировка.Спортсмен КАК Ссылка
		|ИЗ
		|	Документ.Тренировка КАК Тренировка
		|ГДЕ
		|	Тренировка.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Тренировка.Дата УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка
	КонецЕсли;
	
	Возврат Справочники.Спортсмен.ПустаяСсылка();
	
КонецФункции

Функция ПолучитьКрайнееВремяВосстановления() Экспорт
	
	Ответ	= Новый Массив;
	Запрос 	= Новый Запрос;
	
	Запрос.Текст =
	
#Область _ТекстЗапроса_
		"ВЫБРАТЬ
		|	ТНаборУпражнений.Стиль КАК Стиль,
		|	ТНаборУпражнений.Упражнение КАК Упражнение,
		|	ТНаборУпражнений.ГруппаМышц КАК ГруппаМышц
		|ПОМЕСТИТЬ ВТНаборУпражнений
		|ИЗ
		|	РегистрСведений.КонтрольВосстановления КАК ТНаборУпражнений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ТренировкаЖурналТренировок.НомерСтроки) КАК НомерСтроки,
		|	ТренировкаЖурналТренировок.Стиль КАК Стиль,
		|	ТренировкаЖурналТренировок.Ссылка КАК Ссылка,
		|	ТНаборУпражнений.ГруппаМышц КАК ГруппаМышц
		|ПОМЕСТИТЬ ВТЖурналТренировок
		|ИЗ
		|	Документ.Тренировка.ЖурналТренировок КАК ТренировкаЖурналТренировок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНаборУпражнений КАК ТНаборУпражнений
		|		ПО ТренировкаЖурналТренировок.Упражнение = ТНаборУпражнений.Упражнение
		|			И ТренировкаЖурналТренировок.Стиль = ТНаборУпражнений.Стиль
		|
		|СГРУППИРОВАТЬ ПО
		|	ТренировкаЖурналТренировок.Стиль,
		|	ТренировкаЖурналТренировок.Ссылка,
		|	ТНаборУпражнений.ГруппаМышц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТТренировка.Дата КАК Период,
		|	ТЖурналТренировок.НомерСтроки КАК НомерСтроки,
		|	ТЖурналТренировок.Стиль КАК Стиль,
		|	ТЖурналТренировок.Ссылка КАК Ссылка,
		|	ТЖурналТренировок.ГруппаМышц КАК ГруппаМышц
		|ПОМЕСТИТЬ ВТТренировка
		|ИЗ
		|	ВТЖурналТренировок КАК ТЖурналТренировок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Тренировка КАК ТТренировка
		|		ПО ТЖурналТренировок.Ссылка = ТТренировка.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(Тренировка.Период) КАК Период,
		|	Тренировка.Стиль КАК Стиль,
		|	ВТТренировка.ГруппаМышц КАК ГруппаМышц
		|ПОМЕСТИТЬ ВТФиксация
		|ИЗ
		|	РегистрНакопления.Тренировка КАК Тренировка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТренировка КАК ВТТренировка
		|		ПО Тренировка.Регистратор = ВТТренировка.Ссылка
		|			И Тренировка.НомерСтроки = ВТТренировка.НомерСтроки
		|
		|СГРУППИРОВАТЬ ПО
		|	Тренировка.Стиль,
		|	ВТТренировка.ГруппаМышц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТТренировка.Период КАК Период,
		|	ТТренировка.Ссылка КАК ТренировкаСсылка,
		|	ТТренировка.Стиль КАК Стиль,
		|	ТТренировка.ГруппаМышц КАК ГруппаМышц
		|ИЗ
		|	ВТТренировка КАК ТТренировка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФиксация КАК ТФиксация
		|		ПО ТТренировка.Период = ТФиксация.Период
		|			И ТТренировка.Стиль = ТФиксация.Стиль
		|УПОРЯДОЧИТЬ ПО
		|	ТТренировка.ГруппаМышц ВОЗР,
		|	ТТренировка.Период УБЫВ";
#КонецОбласти

	РезультатЗапроса 	= Запрос.Выполнить();	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОтветСтруктура = Новый Структура;
		ОтветСтруктура.Вставить("ТренировкаСсылка");
		ОтветСтруктура.Вставить("ГруппаМышц");
		ОтветСтруктура.Вставить("Стиль");		
		ОтветСтруктура.Вставить("Дни");
		
		ОтветСтруктура.ТренировкаСсылка	= Выборка.ТренировкаСсылка;
		ОтветСтруктура.ГруппаМышц		= Выборка.ГруппаМышц;
		ОтветСтруктура.Стиль			= Строка(Выборка.Стиль);
		РазницаВДнях 					= (НачалоДня(ТекущаяДата()) - НачалоДня(Выборка.Период)) / (60 * 60 * 24);  
		ОтветСтруктура.Дни 				= РазницаВДнях;
		
		Ответ.Добавить(ОтветСтруктура);
	КонецЦикла;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка 	= Ложь;
	Представление 			= "Тренировка " + Формат(Данные.Дата, "ДФ=dd.MM.yyyy");
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = Документы.Тренировка.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	тТренировка.Ссылка,
	|	тТренировка.Дата,
	|	тТренировка.Спортсмен,
	|	тЖурналТренировок.НомерСтроки,
	|	тЖурналТренировок.Упражнение,
	|	тЖурналТренировок.Стиль,
	|	тЖурналТренировок.Сделано,
	|	тЖурналТренировок.Вес,
	|	тЖурналТренировок.ЕдИзм
	|ИЗ
	|	Документ.Тренировка.ЖурналТренировок КАК тЖурналТренировок
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Тренировка КАК тТренировка
	|	ПО тЖурналТренировок.Ссылка = тТренировка.Ссылка
	|ГДЕ
	|	тТренировка.Ссылка В (&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	тЖурналТренировок.Упражнение ВОЗР,
	|	тЖурналТренировок.Стиль ВОЗР,
	|	тЖурналТренировок.НомерСтроки ВОЗР";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок 					= Макет.ПолучитьОбласть("Заголовок");
	Шапка 								= Макет.ПолучитьОбласть("Шапка");
	ОбластьЖурналТренировокШапка 		= Макет.ПолучитьОбласть("ЖурналТренировокШапка");
	ОбластьЖурналТренировок 			= Макет.ПолучитьОбласть("ЖурналТренировок");
	ОбластьЖурналТренировокРазделитель 	= Макет.ПолучитьОбласть("ЖурналТренировокРазделитель");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	ТекущияСсылка				= Неопределено;
	ТекущееУпражнение			= Неопределено;
	ТекущийСтиль				= Неопределено;
	ТекущийНомерСтроки			= 0;
	БылВыводОбластьДляТекДок	= Ложь;
	
	Пока Выборка.Следующий() Цикл
		#Область новыйДок
		Если ТекущияСсылка <> Выборка.Ссылка Тогда
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				ВставлятьРазделительСтраниц = Ложь;
			КонецЕсли;			
			ТабДок.Вывести(ОбластьЗаголовок);

			Шапка.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			ТабДок.Вывести(ОбластьЖурналТренировокШапка);			
		КонецЕсли;
		#КонецОбласти

		Если ТекущееУпражнение <> Выборка.Упражнение ИЛИ ТекущийСтиль <> Выборка.Стиль Тогда
			ТекущееУпражнение 	= Выборка.Упражнение;
			ТекущийСтиль 		= Выборка.Стиль;			
			ТекущийНомерСтроки 	= 0;
			
			Если БылВыводОбластьДляТекДок Тогда
				ТабДок.Вывести(ОбластьЖурналТренировокРазделитель);
			КонецЕсли;
		КонецЕсли;
		
		ОбластьЖурналТренировок.Параметры.Заполнить(Выборка);
		ТекущийНомерСтроки								= ТекущийНомерСтроки + 1;
		ОбластьЖурналТренировок.Параметры.НомерСтроки 	= ТекущийНомерСтроки;
		
		ТабДок.Вывести(ОбластьЖурналТренировок, Выборка.Уровень());
		БылВыводОбластьДляТекДок = Истина;
		
		#Область ПереходНаСледующийДок
		Если ТекущияСсылка <> Выборка.Ссылка Тогда
			ВставлятьРазделительСтраниц = Истина;
			ТекущияСсылка 				= Выборка.Ссылка;
			БылВыводОбластьДляТекДок	= Ложь;
		КонецЕсли;
		#КонецОбласти
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти

#Область Инициализация
#КонецОбласти
